
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Для Каждого ТекСтрокаСписокТМЦ Из ДанныеЗаполнения.СписокТМЦ Цикл
			НоваяСтрока = СписокТМЦ.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокТМЦ.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаСписокТМЦ.Номенклатура;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
		Движение = Движения.ОстаткиНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокТМЦ.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	КонецЦикла;
КонецПроцедуры
