
&НаСервере
Процедура ПроверитьНаличиеНаСервере()
	Для каждого строка из Объект.СписокТМЦ Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		               |	ОстаткиНаСкладеОстатки.Склад КАК Склад,
		               |	ОстаткиНаСкладеОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ИЗ
		               |	РегистрНакопления.ОстаткиНаСкладе.Остатки(&Дата, ) КАК ОстаткиНаСкладеОстатки
		               |ГДЕ
		               |	ОстаткиНаСкладеОстатки.Номенклатура = &Номенклатура
		               |	И ОстаткиНаСкладеОстатки.Склад <> &Склад";
		Запрос.УстановитьПараметр("Склад", Объект.Склад);
		Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Если Строка.Количество < Результат.КоличествоОстаток Тогда
				Строка.Наличие    = Строка.КОличество; 
				Строка.Склад      = Результат.Склад;
			Иначе
				Строка.Наличие = Результат.КоличествоОстаток; 
				Строка.Склад      = Результат.Склад;
			КонецЕсли;
		КонецЕслИ;
	КонецЦикла;  
	Объект.Статус = Перечисления.СтатусыЗаявки.НаИсполнении;  
	ЭтотОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличие(Команда)
	ПроверитьНаличиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	СоздатьДокументыПеремещения();
	СоздатьДОкументыЗаказПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПеремещения() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВТМЦСписокТМЦ.Ссылка КАК Ссылка,
	|	ПотребностьВТМЦСписокТМЦ.НомерСтроки КАК НомерСтроки,
	|	ПотребностьВТМЦСписокТМЦ.Номенклатура КАК Номенклатура,
	|	ПотребностьВТМЦСписокТМЦ.Количество КАК Количество,
	|	ПотребностьВТМЦСписокТМЦ.Наличие КАК Наличие,
	|	ПотребностьВТМЦСписокТМЦ.Обеспечено КАК Обеспечено,
	|	ПотребностьВТМЦСписокТМЦ.Склад КАК Склад
	|ИЗ
	|	Документ.ПотребностьВТМЦ.СписокТМЦ КАК ПотребностьВТМЦСписокТМЦ
	|ГДЕ
	|	ПотребностьВТМЦСписокТМЦ.Ссылка = &Ссылка
	|	И ПотребностьВТМЦСписокТМЦ.Количество <> ПотребностьВТМЦСписокТМЦ.Наличие";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество()= 0 тогда
		ДокПеремещения = Документы.ПеремещениеСоСклада.СоздатьДокумент(); 
		ДокПеремещения.Дата = ТекущаяДата();
		ДокПеремещения.СкладПолучатель = Объект.Склад;
		ДокПеремещения.ДокументОснование = Объект.Ссылка;
		Для каждого строка из Объект.СписокТМЦ цикл
			ДокПеремещения.СкладОтправитель = Строка.Склад;
			НоваяСтрока = ДокПеремещения.СписокТМЦ.Добавить();
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.Количество   = Строка.Количество;
			Строка.Обеспечено = Истина;
		КонецЦикла;  
		ДокПеремещения.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Создан документ перемещения со склада " + ДокПеремещения.Ссылка);    
		Объект.Статус = перечисления.СтатусыЗаявки.ГотовКПолучению;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьДОкументыЗаказПоставщику() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВТМЦСписокТМЦ.Ссылка КАК Ссылка,
	|	ПотребностьВТМЦСписокТМЦ.НомерСтроки КАК НомерСтроки,
	|	ПотребностьВТМЦСписокТМЦ.Номенклатура КАК Номенклатура,
	|	ПотребностьВТМЦСписокТМЦ.Количество КАК Количество,
	|	ПотребностьВТМЦСписокТМЦ.Наличие КАК Наличие,
	|	ПотребностьВТМЦСписокТМЦ.Обеспечено КАК Обеспечено
	|ИЗ
	|	Документ.ПотребностьВТМЦ.СписокТМЦ КАК ПотребностьВТМЦСписокТМЦ
	|ГДЕ
	|	ПотребностьВТМЦСписокТМЦ.Ссылка = &Ссылка
	|	И ПотребностьВТМЦСписокТМЦ.Количество <> ПотребностьВТМЦСписокТМЦ.Наличие";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество()> 0 тогда
		ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент(); 
		ЗаказПоставщику.Дата = ТекущаяДата();
		ЗаказПоставщику.Склад = Объект.Склад;
		ЗаказПоставщику.Организация = Объект.Организация;
		ЗаказПоставщику.ЖелаемаяДата = Объект.ЖелаемаяДата;
		ЗаказПоставщику.ДокументОснование = Объект.Ссылка;
		Для каждого строка из Результат цикл
			НоваяСтрока = ЗаказПоставщику.СписокТМЦ.Добавить();
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.Количество   = Строка.Количество - Строка.Наличие;
		КонецЦикла;  
		ЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Создан документ заказ поставщику " + ЗаказПоставщику.Ссылка);
	КонецЕсли;
КонецПроцедуры
